zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K56X-324BGA-pinctrl.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on S32K56X-437BGA-pinctrl.h with this part's differences applied
 * below (708 removed, 1 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 6972351c3f2da334
 */

#ifndef _ZEPHYR_DTS_BINDING_S32K56X_324BGA_WRAPPER_
#define _ZEPHYR_DTS_BINDING_S32K56X_324BGA_WRAPPER_

#include "S32K56X-437BGA-pinctrl.h"

/* Signals not present on this part */
#undef PD10_1722_TMR1_I
#undef PD10_1722_TMR1_O
#undef PD10_MAC0_MII_TXER
#undef PD10_MAC0_RMII_TXER
#undef PD10_SIUL0_EIRQ14
#undef PD10_TMR_PP1
#undef PD10_USDHC_CMD_I
#undef PD10_USDHC_CMD_O
#undef PD11_MAC0_MII_TXD2
#undef PD11_MAC0_RGMII_TXD2_I
#undef PD11_MAC0_RGMII_TXD2_O
#undef PD11_TRACE_ETM_D3
#undef PD11_USDHC_CLK
#undef PD12_MAC0_MII_TXD3
#undef PD12_MAC0_RGMII_TXD3_I
#undef PD12_MAC0_RGMII_TXD3_O
#undef PD12_TRACE_ETM_CLKOUT
#undef PD12_USDHC_D7_I
#undef PD12_USDHC_D7_O
#undef PD13_MAC0_MII_TXD1
#undef PD13_MAC0_RGMII_TXD1_I
#undef PD13_MAC0_RGMII_TXD1_O
#undef PD13_MAC0_RMII_TXD1
#undef PD13_TRACE_ETM_D4
#undef PD13_USDHC_STROBE
#undef PD13_USDHC_WP
#undef PD14_MAC0_MII_TXD0
#undef PD14_MAC0_RGMII_TXD0_I
#undef PD14_MAC0_RGMII_TXD0_O
#undef PD14_MAC0_RMII_TXD0
#undef PD14_TRACE_ETM_D5
#undef PD14_USDHC_D1_I
#undef PD14_USDHC_D1_O
#undef PD15_MAC0_MII_TXEN
#undef PD15_MAC0_RGMII_TXCTL_I
#undef PD15_MAC0_RGMII_TXCTL_O
#undef PD15_MAC0_RMII_TXEN
#undef PD15_SIUL0_EIRQ11
#undef PD15_TRACE_ETM_D6
#undef PD15_USDHC_D6_I
#undef PD15_USDHC_D6_O
#undef PD3_MAC0_MII_RXD1
#undef PD3_MAC0_RGMII_RXD1_I
#undef PD3_MAC0_RGMII_RXD1_O
#undef PD3_MAC0_RMII_RXD1
#undef PD3_USDHC_D0_I
#undef PD3_USDHC_D0_O
#undef PD4_MAC0_MII_RXD0
#undef PD4_MAC0_RGMII_RXD0_I
#undef PD4_MAC0_RGMII_RXD0_O
#undef PD4_MAC0_RMII_RXD0
#undef PD4_TRACE_ETM_D1
#undef PD4_USDHC_D3_I
#undef PD4_USDHC_D3_O
#undef PD5_MAC0_MII_RXD2
#undef PD5_MAC0_RGMII_RXD2_I
#undef PD5_MAC0_RGMII_RXD2_O
#undef PD5_SIUL0_EIRQ8
#undef PD5_USDHC_RESET_B
#undef PD6_MAC0_MII_RXER
#undef PD6_MAC0_RMII_RXER
#undef PD6_SIUL0_EIRQ9
#undef PD7_1722_TMR2_I
#undef PD7_1722_TMR2_O
#undef PD7_MAC0_MII_RXD3
#undef PD7_MAC0_RGMII_RXD3_I
#undef PD7_MAC0_RGMII_RXD3_O
#undef PD7_TMR_ALARM2
#undef PD7_TMR_PP2
#undef PD7_TMR_TRIG2
#undef PD8_MAC0_MII_RXCLK_I
#undef PD8_MAC0_MII_RXCLK_O
#undef PD8_MAC0_RGMII_RXCLK_I
#undef PD8_MAC0_RGMII_RXCLK_O
#undef PD8_TRACE_ETM_D0
#undef PD8_USDHC_D4_I
#undef PD8_USDHC_D4_O
#undef PD9_1722_TMR3_I
#undef PD9_1722_TMR3_O
#undef PD9_MAC0_MII_RXDV
#undef PD9_MAC0_RGMII_RXCTL_I
#undef PD9_MAC0_RGMII_RXCTL_O
#undef PD9_MAC0_RMII_CRSDV
#undef PD9_SIUL0_EIRQ10
#undef PD9_TMR_ALARM1
#undef PD9_TRACE_ETM_D2
#undef PD9_USDHC_D5_I
#undef PD9_USDHC_D5_O
#undef PE0_MAC0_MII_TXCLK_I
#undef PE0_MAC0_MII_TXCLK_O
#undef PE0_MAC0_RGMII_TXCLK_I
#undef PE0_MAC0_RGMII_TXCLK_O
#undef PE0_MAC0_RMII_REFCLK
#undef PE0_SIUL0_EIRQ12
#undef PE0_TRACE_ETM_D7
#undef PE0_USDHC_D2_I
#undef PE0_USDHC_D2_O
#undef PI10_CAN1_RX
#undef PI10_FXIO0_D12_I
#undef PI10_FXIO0_D12_O
#undef PI10_FXIO0_D28_I
#undef PI10_FXIO0_D28_O
#undef PI10_LPUART3_RX
#undef PI10_SIUL1_EIRQ8
#undef PI2_CAN4_TX
#undef PI2_FXIO0_D20_I
#undef PI2_FXIO0_D20_O
#undef PI2_FXIO0_D4_I
#undef PI2_FXIO0_D4_O
#undef PI2_LPSPI2_SIN_I
#undef PI2_LPSPI2_SIN_O
#undef PI2_LPUART12_RX
#undef PI2_LPUART7_RX
#undef PI2_SIUL1_EIRQ0
#undef PI3_CAN4_RX
#undef PI3_FXIO0_D21_I
#undef PI3_FXIO0_D21_O
#undef PI3_FXIO0_D5_I
#undef PI3_FXIO0_D5_O
#undef PI3_LPSPI2_SOUT_I
#undef PI3_LPSPI2_SOUT_O
#undef PI3_LPUART11_TX_I
#undef PI3_LPUART11_TX_O
#undef PI3_LPUART5_RX
#undef PI3_SIUL1_EIRQ1
#undef PI4_CAN5_TX
#undef PI4_FXIO0_D22_I
#undef PI4_FXIO0_D22_O
#undef PI4_FXIO0_D6_I
#undef PI4_FXIO0_D6_O
#undef PI4_LPSPI2_SCK_I
#undef PI4_LPSPI2_SCK_O
#undef PI4_LPUART11_RX
#undef PI4_LPUART5_TX_I
#undef PI4_LPUART5_TX_O
#undef PI4_SIUL1_EIRQ2
#undef PI5_CAN5_RX
#undef PI5_FXIO0_D23_I
#undef PI5_FXIO0_D23_O
#undef PI5_FXIO0_D7_I
#undef PI5_FXIO0_D7_O
#undef PI5_LPSPI2_PCS0_I
#undef PI5_LPSPI2_PCS0_O
#undef PI5_LPUART12_TX_I
#undef PI5_LPUART12_TX_O
#undef PI5_LPUART5_RX
#undef PI5_SIUL1_EIRQ3
#undef PI6_CAN2_TX
#undef PI6_CAN7_TX
#undef PI6_FXIO0_D24_I
#undef PI6_FXIO0_D24_O
#undef PI6_FXIO0_D8_I
#undef PI6_FXIO0_D8_O
#undef PI6_LPSPI2_PCS1_I
#undef PI6_LPSPI2_PCS1_O
#undef PI6_LPUART12_RX
#undef PI6_LPUART9_RX
#undef PI6_SIUL1_EIRQ4
#undef PI7_CAN6_TX
#undef PI7_CAN7_RX
#undef PI7_FXIO0_D25_I
#undef PI7_FXIO0_D25_O
#undef PI7_FXIO0_D9_I
#undef PI7_FXIO0_D9_O
#undef PI7_LPSPI2_PCS3_I
#undef PI7_LPSPI2_PCS3_O
#undef PI7_LPUART12_TX_I
#undef PI7_LPUART12_TX_O
#undef PI7_LPUART13_TX_I
#undef PI7_LPUART13_TX_O
#undef PI7_LPUART9_TX_I
#undef PI7_LPUART9_TX_O
#undef PI7_SIUL1_EIRQ5
#undef PI8_CAN6_RX
#undef PI8_FXIO0_D10_I
#undef PI8_FXIO0_D10_O
#undef PI8_FXIO0_D26_I
#undef PI8_FXIO0_D26_O
#undef PI8_LPUART10_RX
#undef PI8_LPUART13_RX
#undef PI8_SIUL1_EIRQ6
#undef PI9_CAN1_TX
#undef PI9_FXIO0_D11_I
#undef PI9_FXIO0_D11_O
#undef PI9_FXIO0_D27_I
#undef PI9_FXIO0_D27_O
#undef PI9_LPUART13_TX_I
#undef PI9_LPUART13_TX_O
#undef PI9_LPUART3_TX_I
#undef PI9_LPUART3_TX_O
#undef PI9_SIUL1_EIRQ7
#undef PK11_LPE_CXPI1_TX
#undef PK11_LPE_FTM_FLT3
#undef PK11_LPE_LPUART1_TX_I
#undef PK11_LPE_LPUART1_TX_O
#undef PK11_LPE_SIUL2_EIRQ4
#undef PK12_LPE_CXPI1_RX
#undef PK12_LPE_FTM_QD_PHB
#undef PK12_LPE_LPUART1_RX
#undef PK12_LPE_SIUL2_EIRQ5
#undef PK12_LPE_TRGMUX_IN0
#undef PK13_LPE_FTM_CH0_I
#undef PK13_LPE_FTM_CH0_O
#undef PK13_LPE_LCU0_OUT1
#undef PK13_LPE_LPUART2_RX
#undef PK13_LPE_SIUL2_EIRQ6
#undef PK13_LPE_TRGMUX_IN1
#undef PK14_LPE_FTM_QD_PHA
#undef PK14_LPE_LCU0_OUT0
#undef PK14_LPE_LPUART2_TX_I
#undef PK14_LPE_LPUART2_TX_O
#undef PK14_LPE_SIUL2_EIRQ7
#undef PK14_LPE_TRGMUX_IN7
#undef PK15_LPE_FTM_CH2_I
#undef PK15_LPE_FTM_CH2_O
#undef PK15_LPE_LCU0_OUT3
#undef PK15_LPE_LPSPI0_PCS1_I
#undef PK15_LPE_LPSPI0_PCS1_O
#undef PK15_LPE_LPUART2_TX_I
#undef PK15_LPE_LPUART2_TX_O
#undef PK15_LPE_SIUL2_EIRQ8
#undef PK15_LPE_TRGMUX_IN6
#undef PL0_LPE_FTM_CH1_I
#undef PL0_LPE_FTM_CH1_O
#undef PL0_LPE_LCU0_OUT2
#undef PL0_LPE_LPSPI0_PCS3_I
#undef PL0_LPE_LPSPI0_PCS3_O
#undef PL0_LPE_LPUART2_RX
#undef PL0_LPE_SIUL2_EIRQ9
#undef PL0_LPE_TRGMUX_IN2
#undef PL10_LPE_ADC_MA2
#undef PL10_LPE_FTM_CH5_I
#undef PL10_LPE_FTM_CH5_O
#undef PL10_LPE_LPI2C0_SCLS_I
#undef PL10_LPE_LPI2C0_SCLS_O
#undef PL10_LPE_LPSPI1_SCK_I
#undef PL10_LPE_LPSPI1_SCK_O
#undef PL10_LPE_LPUART0_RTS
#undef PL10_LPE_LPUART2_TX_I
#undef PL10_LPE_LPUART2_TX_O
#undef PL10_LPE_SIUL2_EIRQ3
#undef PL10_LPE_TRGMUX_OUT0
#undef PL11_LPE_FTM_CH0_I
#undef PL11_LPE_FTM_CH0_O
#undef PL11_LPE_LPI2C0_SDA_I
#undef PL11_LPE_LPI2C0_SDA_O
#undef PL11_LPE_LPSPI1_SIN_I
#undef PL11_LPE_LPSPI1_SIN_O
#undef PL11_LPE_LPUART0_CTS
#undef PL11_LPE_SIUL2_EIRQ4
#undef PL11_LPE_TRGMUX_OUT3
#undef PL12_LPE_ADC_MA0
#undef PL12_LPE_CAN0_RX
#undef PL12_LPE_FTM_CH3_I
#undef PL12_LPE_FTM_CH3_O
#undef PL12_LPE_SIUL2_EIRQ5
#undef PL12_LPE_TRGMUX_OUT7
#undef PL12_LPUART_DSR_B
#undef PL13_LPE_ADC_MA1
#undef PL13_LPE_CAN0_TX
#undef PL13_LPE_FTM_CH2_I
#undef PL13_LPE_FTM_CH2_O
#undef PL13_LPE_LPUART1_TX_I
#undef PL13_LPE_LPUART1_TX_O
#undef PL13_LPE_SIUL2_EIRQ5
#undef PL13_LPUART_DTR_B
#undef PL14_LPE_ADC_MA2
#undef PL14_LPE_FTM_CH7_I
#undef PL14_LPE_FTM_CH7_O
#undef PL14_LPE_SIUL2_EIRQ6
#undef PL14_LPE_TRGMUX_OUT4
#undef PL14_LPUART_RIN_B
#undef PL15_LPE_CMP0_RRT
#undef PL15_LPE_FTM_CH6_I
#undef PL15_LPE_FTM_CH6_O
#undef PL15_LPE_LPUART1_RX
#undef PL15_LPE_SIUL2_EIRQ7
#undef PL15_LPE_TRGMUX_OUT5
#undef PL1_LPE_CAN0_RX
#undef PL1_LPE_CMP2_RRT
#undef PL1_LPE_FTM_CH4_I
#undef PL1_LPE_FTM_CH4_O
#undef PL1_LPE_LCU0_OUT3
#undef PL1_LPE_LPSPI0_PCS2_I
#undef PL1_LPE_LPSPI0_PCS2_O
#undef PL1_LPE_LPUART1_TX_I
#undef PL1_LPE_LPUART1_TX_O
#undef PL1_LPE_SIUL2_EIRQ10
#undef PL1_LPE_TRGMUX_IN3
#undef PL2_LPE_CAN0_TX
#undef PL2_LPE_CMP2_OUT
#undef PL2_LPE_FTM_CH3_I
#undef PL2_LPE_FTM_CH3_O
#undef PL2_LPE_LCU0_OUT2
#undef PL2_LPE_LPSPI0_PCS0_I
#undef PL2_LPE_LPSPI0_PCS0_O
#undef PL2_LPE_LPUART0_RTS
#undef PL2_LPE_LPUART1_RX
#undef PL2_LPE_SIUL2_EIRQ11
#undef PL3_LPE_CMP1_RRT
#undef PL3_LPE_FTM_CH6_I
#undef PL3_LPE_FTM_CH6_O
#undef PL3_LPE_LPSPI0_SIN_I
#undef PL3_LPE_LPSPI0_SIN_O
#undef PL3_LPE_LPUART0_CTS
#undef PL3_LPE_SIUL2_EIRQ12
#undef PL4_CLKOUT_LPRUN
#undef PL4_LPE_CMP1_OUT
#undef PL4_LPE_CXPI0_TX
#undef PL4_LPE_FTM_CH5_I
#undef PL4_LPE_FTM_CH5_O
#undef PL4_LPE_LPSPI0_SCK_I
#undef PL4_LPE_LPSPI0_SCK_O
#undef PL4_LPE_LPUART0_RX
#undef PL4_LPE_SIUL2_EIRQ13
#undef PL5_LPE_ADC_MA2
#undef PL5_LPE_CMP0_OUT
#undef PL5_LPE_CXPI0_RX
#undef PL5_LPE_FTM_CH7_I
#undef PL5_LPE_FTM_CH7_O
#undef PL5_LPE_LPSPI0_SOUT_I
#undef PL5_LPE_LPSPI0_SOUT_O
#undef PL5_LPE_LPUART0_TX_I
#undef PL5_LPE_LPUART0_TX_O
#undef PL5_LPE_SIUL2_EIRQ14
#undef PL6_LPE_ADC_MA0
#undef PL6_LPE_CMP0_RRT
#undef PL6_LPE_FTM_CH5_I
#undef PL6_LPE_FTM_CH5_O
#undef PL6_LPE_LPUART2_RX
#undef PL6_LPE_SIUL2_EIRQ15
#undef PL7_LPE_ADC_MA1
#undef PL7_LPE_FTM_CH4_I
#undef PL7_LPE_FTM_CH4_O
#undef PL7_LPE_LPI2C0_SDAS_I
#undef PL7_LPE_LPI2C0_SDAS_O
#undef PL7_LPE_LPSPI1_SOUT_I
#undef PL7_LPE_LPSPI1_SOUT_O
#undef PL7_LPE_LPUART0_RX
#undef PL7_LPE_SIUL2_EIRQ0
#undef PL7_LPE_TRGMUX_OUT1
#undef PL8_LPE_CXPI1_TX
#undef PL8_LPE_FTM_CH1_I
#undef PL8_LPE_FTM_CH1_O
#undef PL8_LPE_LPI2C0_SCL_I
#undef PL8_LPE_LPI2C0_SCL_O
#undef PL8_LPE_LPSPI1_PCS0_I
#undef PL8_LPE_LPSPI1_PCS0_O
#undef PL8_LPE_LPUART0_TX_I
#undef PL8_LPE_LPUART0_TX_O
#undef PL8_LPE_SIUL2_EIRQ1
#undef PL8_LPE_TRGMUX_OUT2
#undef PL9_LPE_CXPI1_RX
#undef PL9_LPE_FTM_FLT3
#undef PL9_LPE_LPI2C0_HREQ
#undef PL9_LPE_LPSPI1_PCS1_I
#undef PL9_LPE_LPSPI1_PCS1_O
#undef PL9_LPE_SIUL2_EIRQ2
#undef PL9_LPE_TRGMUX_OUT6
#undef PL9_LPUART_DCD_B
#undef PP11_CAN10_RX
#undef PP11_DSPI_MSC0_SIN
#undef PP11_EMIOS0_CH22_X_I
#undef PP11_EMIOS0_CH22_X_O
#undef PP11_FXIO1_D10_I
#undef PP11_FXIO1_D10_O
#undef PP11_FXIO1_D26_I
#undef PP11_FXIO1_D26_O
#undef PP11_LCU0_IN7
#undef PP11_LCU0_OUT7
#undef PP11_LPSPI3_SOUT_I
#undef PP11_LPSPI3_SOUT_O
#undef PP11_LPUART15_TX_I
#undef PP11_LPUART15_TX_O
#undef PP11_SINC_MBIT0
#undef PP11_SIUL3_EIRQ1
#undef PP11_TRGMUX_IN5
#undef PP13_CAN10_TX
#undef PP13_DSPI_MSC0_SCK
#undef PP13_EMIOS0_CH8_X_I
#undef PP13_EMIOS0_CH8_X_O
#undef PP13_FXIO1_D12_I
#undef PP13_FXIO1_D12_O
#undef PP13_FXIO1_D28_I
#undef PP13_FXIO1_D28_O
#undef PP13_LCU0_IN9
#undef PP13_LCU0_OUT9
#undef PP13_LPI2C1_SCL_I
#undef PP13_LPI2C1_SCL_O
#undef PP13_LPSPI3_PCS2_I
#undef PP13_LPSPI3_PCS2_O
#undef PP13_LPUART16_TX_I
#undef PP13_LPUART16_TX_O
#undef PP13_SINC_MCLK1
#undef PP13_SIUL3_EIRQ2
#undef PP13_TRGMUX_IN3
#undef PP14_ADC0_MA2
#undef PP14_CAN10_RX
#undef PP14_DSPI_MSC0_SOUT
#undef PP14_EMIOS0_CH16_X_I
#undef PP14_EMIOS0_CH16_X_O
#undef PP14_FXIO1_D11_I
#undef PP14_FXIO1_D11_O
#undef PP14_FXIO1_D27_I
#undef PP14_FXIO1_D27_O
#undef PP14_LCU0_IN8
#undef PP14_LCU0_OUT8
#undef PP14_LPI2C1_SDA_I
#undef PP14_LPI2C1_SDA_O
#undef PP14_LPSPI3_PCS3_I
#undef PP14_LPSPI3_PCS3_O
#undef PP14_LPUART16_RX
#undef PP14_SINC_MBIT1
#undef PP14_SIUL3_EIRQ3
#undef PP14_TRGMUX_IN2
#undef PP9_CAN10_TX
#undef PP9_EMIOS0_CH18_Y_I
#undef PP9_EMIOS0_CH18_Y_O
#undef PP9_FXIO1_D25_I
#undef PP9_FXIO1_D25_O
#undef PP9_FXIO1_D9_I
#undef PP9_FXIO1_D9_O
#undef PP9_LCU0_IN6
#undef PP9_LCU0_OUT6
#undef PP9_LPI2C1_HREQ
#undef PP9_LPSPI3_SIN_I
#undef PP9_LPSPI3_SIN_O
#undef PP9_LPUART15_RX
#undef PP9_LPUART21_RX
#undef PP9_SINC_MCLK0_OUT
#undef PP9_SIUL3_EIRQ0
#undef PP9_TRGMUX_IN4
#undef PQ0_DSPI_MSC0_PCS0
#undef PQ0_EMIOS0_CH7_G_I
#undef PQ0_EMIOS0_CH7_G_O
#undef PQ0_FXIO1_D24_I
#undef PQ0_FXIO1_D24_O
#undef PQ0_FXIO1_D8_I
#undef PQ0_FXIO1_D8_O
#undef PQ0_LCU0_IN5
#undef PQ0_LCU0_OUT5
#undef PQ0_LPI2C2_HREQ
#undef PQ0_LPSPI3_SCK_I
#undef PQ0_LPSPI3_SCK_O
#undef PQ0_SINC_MCLK1_OUT
#undef PQ0_SIUL3_EIRQ4
#undef PQ0_TRGMUX_IN0
#undef PQ0_TRGMUX_OUT0
#undef PQ1_DSPI_MSC0_HT
#undef PQ1_DSPI_MSC1_PCS0
#undef PQ1_EMIOS0_CH5_G_I
#undef PQ1_EMIOS0_CH5_G_O
#undef PQ1_FXIO1_D23_I
#undef PQ1_FXIO1_D23_O
#undef PQ1_FXIO1_D7_I
#undef PQ1_FXIO1_D7_O
#undef PQ1_LCU0_IN4
#undef PQ1_LCU0_OUT4
#undef PQ1_LPI2C2_SCL_I
#undef PQ1_LPI2C2_SCL_O
#undef PQ1_LPSPI3_PCS0_I
#undef PQ1_LPSPI3_PCS0_O
#undef PQ1_LPSPI4_PCS0_I
#undef PQ1_LPSPI4_PCS0_O
#undef PQ1_SINC_MCLK0
#undef PQ1_SIUL3_EIRQ5
#undef PQ1_TRGMUX_IN1
#undef PQ1_TRGMUX_OUT1
#undef PQ3_EMIOS0_CH3_G_I
#undef PQ3_EMIOS0_CH3_G_O
#undef PQ3_FXIO1_D22_I
#undef PQ3_FXIO1_D22_O
#undef PQ3_FXIO1_D6_I
#undef PQ3_FXIO1_D6_O
#undef PQ3_LCU0_IN3
#undef PQ3_LCU0_OUT3
#undef PQ3_LPI2C2_SDA_I
#undef PQ3_LPI2C2_SDA_O
#undef PQ3_LPSPI3_PCS1_I
#undef PQ3_LPSPI3_PCS1_O
#undef PQ3_LPSPI4_PCS1_I
#undef PQ3_LPSPI4_PCS1_O
#undef PQ3_LPUART15_TX_I
#undef PQ3_LPUART15_TX_O
#undef PQ3_SINC_MCLK2
#undef PQ3_SIUL3_EIRQ6
#undef PQ3_TRGMUX_OUT3
#undef PQ5_ADC0_MA1
#undef PQ5_DSPI_MSC1_SIN
#undef PQ5_EMIOS0_CH1_G_I
#undef PQ5_EMIOS0_CH1_G_O
#undef PQ5_FXIO1_D21_I
#undef PQ5_FXIO1_D21_O
#undef PQ5_FXIO1_D5_I
#undef PQ5_FXIO1_D5_O
#undef PQ5_LCU0_IN2
#undef PQ5_LCU0_OUT2
#undef PQ5_LPI2C2_HREQ
#undef PQ5_LPSPI4_SCK_I
#undef PQ5_LPSPI4_SCK_O
#undef PQ5_LPUART15_RX
#undef PQ5_SINC_MCLK2_OUT
#undef PQ5_SIUL3_EIRQ13
#undef PQ5_TRGMUX_OUT4
#undef PQ6_ADC0_MA2
#undef PQ6_DSPI_MSC1_SOUT
#undef PQ6_EMIOS0_CH0_X_I
#undef PQ6_EMIOS0_CH0_X_O
#undef PQ6_FXIO1_D20_I
#undef PQ6_FXIO1_D20_O
#undef PQ6_FXIO1_D4_I
#undef PQ6_FXIO1_D4_O
#undef PQ6_LCU0_IN1
#undef PQ6_LCU0_OUT1
#undef PQ6_LPI2C2_SCL_I
#undef PQ6_LPI2C2_SCL_O
#undef PQ6_LPSPI4_SIN_I
#undef PQ6_LPSPI4_SIN_O
#undef PQ6_LPUART16_TX_I
#undef PQ6_LPUART16_TX_O
#undef PQ6_SINC_MCLK3
#undef PQ6_SIUL3_EIRQ14
#undef PQ6_TRGMUX_OUT7
#undef PQ7_DSPI_MSC1_SCK
#undef PQ7_FXIO1_D19_I
#undef PQ7_FXIO1_D19_O
#undef PQ7_FXIO1_D3_I
#undef PQ7_FXIO1_D3_O
#undef PQ7_LCU0_IN0
#undef PQ7_LCU0_OUT0
#undef PQ7_LPI2C2_SDA_I
#undef PQ7_LPI2C2_SDA_O
#undef PQ7_LPSPI4_SOUT_I
#undef PQ7_LPSPI4_SOUT_O
#undef PQ7_LPUART16_RX
#undef PQ7_SIUL3_EIRQ15
#undef PQ7_TRGMUX_OUT5
#undef PV11_CAN15_RX
#undef PV11_EMIOS1_CH15_H_I
#undef PV11_EMIOS1_CH15_H_O
#undef PV11_EMIOS2_CH15_H_I
#undef PV11_EMIOS2_CH15_H_O
#undef PV11_LCU1_IN4
#undef PV11_LCU1_OUT4
#undef PV11_LPSPI5_PCS1_I
#undef PV11_LPSPI5_PCS1_O
#undef PV11_LPUART20_TX_I
#undef PV11_LPUART20_TX_O
#undef PV11_SIUL4_EIRQ8
#undef PV11_TRACE_ETM_D8
#undef PV14_ADC1_MA2
#undef PV14_CAN15_RX
#undef PV14_EMIOS1_CH21_Y_I
#undef PV14_EMIOS1_CH21_Y_O
#undef PV14_EMIOS2_CH21_Y_I
#undef PV14_EMIOS2_CH21_Y_O
#undef PV14_LCU1_IN3
#undef PV14_LCU1_OUT3
#undef PV14_LPSPI5_PCS2_I
#undef PV14_LPSPI5_PCS2_O
#undef PV14_LPUART17_RX
#undef PV14_SIUL4_EIRQ7
#undef PV3_EMIOS2_CH22_X_I
#undef PV3_EMIOS2_CH22_X_O
#undef PV3_LPI2C3_SDA_I
#undef PV3_LPI2C3_SDA_O
#undef PV3_LPSPI5_SOUT_I
#undef PV3_LPSPI5_SOUT_O
#undef PV3_SIUL4_EIRQ0
#undef PV4_CAN13_RX
#undef PV4_EMIOS2_CH23_X_I
#undef PV4_EMIOS2_CH23_X_O
#undef PV4_LPI2C3_SCL_I
#undef PV4_LPI2C3_SCL_O
#undef PV4_LPSPI5_SIN_I
#undef PV4_LPSPI5_SIN_O
#undef PV4_SIUL4_EIRQ1
#undef PV5_CAN13_TX
#undef PV5_EMIOS1_CH0_X_I
#undef PV5_EMIOS1_CH0_X_O
#undef PV5_LPI2C3_HREQ
#undef PV5_LPSPI5_SCK_I
#undef PV5_LPSPI5_SCK_O
#undef PV5_LPUART19_RX
#undef PV5_SIUL4_EIRQ2
#undef PV6_CAN16_TX
#undef PV6_EMIOS1_CH8_X_I
#undef PV6_EMIOS1_CH8_X_O
#undef PV6_LPSPI5_PCS0_I
#undef PV6_LPSPI5_PCS0_O
#undef PV6_LPUART19_RX
#undef PV6_SIUL4_EIRQ3
#undef PV7_CAN16_RX
#undef PV7_EMIOS1_CH22_X_I
#undef PV7_EMIOS1_CH22_X_O
#undef PV7_LCU1_IN0
#undef PV7_LCU1_OUT0
#undef PV7_LPSPI5_PCS2_I
#undef PV7_LPSPI5_PCS2_O
#undef PV7_LPUART17_RX
#undef PV7_LPUART19_TX_I
#undef PV7_LPUART19_TX_O
#undef PV7_SIUL4_EIRQ4
#undef PV8_EMIOS2_CH3_H_I
#undef PV8_EMIOS2_CH3_H_O
#undef PV8_LCU1_IN1
#undef PV8_LCU1_OUT1
#undef PV8_LPSPI5_PCS3_I
#undef PV8_LPSPI5_PCS3_O
#undef PV8_LPUART17_TX_I
#undef PV8_LPUART17_TX_O
#undef PV8_SIUL4_EIRQ5
#undef PV9_CAN15_TX
#undef PV9_EMIOS1_CH20_Y_I
#undef PV9_EMIOS1_CH20_Y_O
#undef PV9_EMIOS2_CH20_Y_I
#undef PV9_EMIOS2_CH20_Y_O
#undef PV9_LCU1_IN2
#undef PV9_LCU1_OUT2
#undef PV9_LPSPI5_PCS3_I
#undef PV9_LPSPI5_PCS3_O
#undef PV9_LPUART17_TX_I
#undef PV9_LPUART17_TX_O
#undef PV9_SIUL4_EIRQ6
#undef PW0_CAN12_RX
#undef PW0_EMIOS1_CH17_Y_I
#undef PW0_EMIOS1_CH17_Y_O
#undef PW0_EMIOS2_CH17_Y_I
#undef PW0_EMIOS2_CH17_Y_O
#undef PW0_LCU1_IN6
#undef PW0_LCU1_OUT6
#undef PW0_LPSPI5_SOUT_I
#undef PW0_LPSPI5_SOUT_O
#undef PW0_LPUART19_RX
#undef PW0_SIUL4_EIRQ10
#undef PW0_TRACE_ETM_D10
#undef PW10_CAN11_RX
#undef PW10_CAN14_RX
#undef PW10_EMIOS2_CH1_H_I
#undef PW10_EMIOS2_CH1_H_O
#undef PW10_LCU1_IN11
#undef PW10_LCU1_OUT11
#undef PW10_LPSPI5_PCS7_I
#undef PW10_LPSPI5_PCS7_O
#undef PW10_SIUL4_EIRQ15
#undef PW10_TRACE_ETM_D15
#undef PW11_CAN14_RX
#undef PW11_EMIOS1_CH11_H_I
#undef PW11_EMIOS1_CH11_H_O
#undef PW11_EMIOS2_CH11_H_I
#undef PW11_EMIOS2_CH11_H_O
#undef PW11_LCU1_IN9
#undef PW11_LCU1_OUT9
#undef PW11_LPI2C3_SDA_I
#undef PW11_LPI2C3_SDA_O
#undef PW11_LPSPI5_SCK_I
#undef PW11_LPSPI5_SCK_O
#undef PW11_LPUART17_RX
#undef PW11_SIUL4_EIRQ12
#undef PW11_TRACE_ETM_D12
#undef PW2_CAN15_TX
#undef PW2_EMIOS1_CH13_H_I
#undef PW2_EMIOS1_CH13_H_O
#undef PW2_EMIOS2_CH13_H_I
#undef PW2_EMIOS2_CH13_H_O
#undef PW2_LCU1_IN5
#undef PW2_LCU1_OUT5
#undef PW2_LPSPI5_PCS4_I
#undef PW2_LPSPI5_PCS4_O
#undef PW2_LPUART20_RX
#undef PW2_SIUL4_EIRQ9
#undef PW2_TRACE_ETM_D9
#undef PW4_CAN12_TX
#undef PW4_EMIOS1_CH10_H_I
#undef PW4_EMIOS1_CH10_H_O
#undef PW4_EMIOS2_CH10_H_I
#undef PW4_EMIOS2_CH10_H_O
#undef PW4_LCU1_IN7
#undef PW4_LCU1_OUT7
#undef PW4_LPSPI5_SIN_I
#undef PW4_LPSPI5_SIN_O
#undef PW4_LPUART19_TX_I
#undef PW4_LPUART19_TX_O
#undef PW4_SIUL4_EIRQ11
#undef PW4_TRACE_ETM_D11
#undef PW6_CAN14_TX
#undef PW6_EMIOS1_CH7_H_I
#undef PW6_EMIOS1_CH7_H_O
#undef PW6_EMIOS2_CH7_H_I
#undef PW6_EMIOS2_CH7_H_O
#undef PW6_LCU1_IN8
#undef PW6_LCU1_OUT8
#undef PW6_LPSPI5_PCS5_I
#undef PW6_LPSPI5_PCS5_O
#undef PW6_LPUART17_TX_I
#undef PW6_LPUART17_TX_O
#undef PW6_SIUL4_EIRQ13
#undef PW6_TRACE_ETM_D13
#undef PW9_CAN11_TX
#undef PW9_CAN14_TX
#undef PW9_EMIOS2_CH4_H_I
#undef PW9_EMIOS2_CH4_H_O
#undef PW9_LCU1_IN10
#undef PW9_LCU1_OUT10
#undef PW9_LPSPI5_PCS6_I
#undef PW9_LPSPI5_PCS6_O
#undef PW9_SIUL4_EIRQ14
#undef PW9_TRACE_ETM_D14

/* Signals with different mux data on this part */
#undef PA9_XSPI_SCKFA
#define PA9_XSPI_SCKFA#                 NXP_SIUL2_PINMUX(0, 0, 9, 1, 0, 0)

#endif /* _ZEPHYR_DTS_BINDING_S32K56X_324BGA_WRAPPER_ */
